export const MENU = [
  {
    name: "Афиша",
    link: "tour",
  },
  {
    name: "Альбом",
    link: "albums",
  },
  {
    name: "Релизы",
    link: "tracks",
  },
  {
    name: "О группе",
    link: "about",
  },
  {
    name: "Новости",
    link: "news",
  },

  {
    name: "Мерч",
    link: "shop",
  },
  {
    name: "Контакты",
    link: "contact",
  },
];

export const SOCIALMEDIA = [
  {
    icon: "youtube",
    link: "https://www.youtube.com/@Luverance",
  },
  {
    icon: "vk",
    link: "https://vk.com/luverance",
  },
  {
    icon: "applemusic",
    link: "https://music.apple.com/gb/artist/luverance/1504929593",
  },
  {
    icon: "soundcloud",
    link: "https://soundcloud.com/luverance",
  },
  {
    icon: "spotify",
    link: "https://open.spotify.com/artist/5a0QXyCGGsEzG0BWNEBfdq",
  },
  {
    icon: "yandexmusic",
    link: "https://music.yandex.ru/artist/8947630/info",
  },
  {
    icon: "telegram",
    link: "https://t.me/luverance",
  },
];

// export const MAIN_URL = `https://${process.env.REACT_APP_PROJECT_ID}.api.sanity.io/v2021-10-21/data/query/${DATASET}?query=${QUERY}`;

export const shopImages = [
  "/images/shop1.jpg",
  "/images/shop2.jpg",
  "/images/shop3.jpg",
  "/images/shop4.jpg",
  "/images/shop5.jpg",
  "/images/shop6.jpg",
];

export const tracks = [
  {
    id: 0,
    title: "Пой",
    link: "https://music.yandex.ru/iframe/track/117612160/27480987",
    trackId: "117612160",
    albumId: "27480987",
    description: "2023, Produced by Luverance",
    text: "Пой, горе\n\nЗаполони мои глаза солью\n\nВнутри меня, внутри меня вскоре\n\nОткажут все-все тормоза\n\nЗабери мое сердце\n\nВсе отдал бы лишь ты вернул назад мне с небес мое детство\n\nОни меня слышат\n\nЯ с крыш им кричу в глаза\n\nЗабери мое сердце, все отдал бы лишь ты вернул назад\n\nЗабери мое сердце, но ты, не спросив, его отобрал\n\nИ вопреки моей воле этому нет конца\n\nВ груди посреди боли пылилась пустота\n\nСмотри в моих глазах фунт соли\n\nЯ потерял отца\n\nСердце мое без крови\n\nТам вечная мерзлота\n\nПой, горе\n\nЗаполони мои глаза солью\n\nВнутри меня, внутри меня вскоре\n\nОткажут все-все тормоза\n\nПропой: «Я сгину с ветром»\n\nТемнее ночи чернота\n\nСлепой не верит свету\n\nА я не верю в чудеса",
    imgSrc: "/releases/poi.jpg",
  },
  {
    id: 1,
    title: "Вся моя жизнь",
    link: "https://music.yandex.ru/iframe/track/115428624/26569170",
    trackId: "115428624",
    albumId: "26569170",
    description: "2023, Produced by Luverance",
    text: "Солнце, гаснет закат\n\nА за ним следом падает солнце\n\nЧто бы мне тёмному ветру сказать?\n\nПопробуй переговори мои голоса\n\nОт пыли застыли корабли и не летается птицам\n\nСлёзы молили «Помоги» у Христа отца\n\nЗа что мне это, mon ami, ночами длинными снится?\n\nЭти гласа — все без лица\n\nНету края им, нет конца\n\nЕретикам нету рая\n\nНашла коса, камень в глазах у Илая\n\nНашла коса, камень в глазах\n\nЛетом дожди\n\nСледом с ветром пролетает\n\nВся моя жизнь\n\nНо мне нет ни конца, ни края\n\nЛетом дожди\n\nСледом с ветром пролетает\n\nВся моя жизнь\n\nНо ей нет ни конца, ни края",
    imgSrc: "/releases/vsyamoyazhizn.jpg",
  },
  {
    id: 2,
    title: "123",
    link: "https://music.yandex.ru/iframe/track/64074671/10848006",
    trackId: "64074671",
    albumId: "10848006",
    description: "2020",
    text: "Пролетая над мимо города\n\nЧерно–белым вороном, разбросив перья по ветру\n\nВ поисках тёмного моря, в поисках горя\n\nЯ тебя не найду\n\nРаз, два, три\n\nТы спряталась\n\nСолнце закатами\n\nРадует\n\nХватит стесняться ли?\n\nУходить, не возвращаться и\n\nСтоит ли нам прощаться?\n\nВстречи, речи, легче трогай пламя\n\nСвечи, вечер, метчик, замкнутая петля\n\nПролетая над мимо города\n\nПотерял, что искал я\n\nВек, заря, восставало знамя\n\nЯкоря все поднять под пламя\n\nЗапевай крылья песню ветра\n\nЧтоб согреться мне лучами света\n\nИзбегая тот град, но город разгромлен\n\nВзгляды назад, нехотя ужас вспомнив\n\nЭхо войны в виде ран и на теле\n\nЧёртовы демоны, чёртовы звери\n\nИзбегая тот град, но город разгромлен\n\nВзгляды назад, нехотя ужас вспомнив\n\nЭхо войны в виде ран и на теле\n\nЧёртовы демоны, чёртовы звери",
    imgSrc: "/releases/123.jpg",
  },

  {
    id: 3,
    title: "Море",
    link: "https://music.yandex.ru/iframe/track/101102892/21288995",
    trackId: "101102892",
    albumId: "21288995",
    description: "2022",
    text: "На поле встал воин\n\nИ в радость, и в горе\n\nВдыхаю пары твои\n\nМоре, порывы ветра и раздолья\n\nМою душу не скроет\n\nВзгляд щенячий не вскроет\n\nЯ тону в тебе, море\n\nТоплю в тебе взгляды боли\n\nДля каждого море своё\n\nОно сильнее ветра\n\nДля каждого горе — порок\n\nНо не конец света\n\nЯ знаю, я верю, я смог и это так нелепо\n\nЛа-ла-ла-лай-ла-ля\n\nЛа-ла-ла-лай-ла-ля\n\nЛа-ла-ла-лай-ла-ля\n\nПойми, всё так и бывает\n\nЧто ты чего-то не знаешь порой\n\nТак часто не знаешь пароль\n\nОдни на целом свете летаем\n\nНо кто-то смог вдруг унять твою боль\n\nСмог вдруг унять твою боль\n\nДруг моря — я, и волны — я\n\nГлаза, глаза, глаза горят\n\nНо что живя на то сияй\n\nВсе дни мои по ветру",
    imgSrc: "/releases/more.jpg",
  },
  {
    id: 4,
    title: "Спи",
    link: "https://music.yandex.ru/iframe/track/79244644/14378452",
    trackId: "79244644",
    albumId: "14378452",
    description: "2021",
    text: "Спи\n\nНа плече мы в дороге\n\nИзранены ноги от ям и путей\n\nНо ты спи\n\nВ заточении ладони\n\nСквозь время и боли я слышу твоё «Отпусти»\n\nЗакрывая все те сквозняки\n\nВсего прошлого окна на ставни\n\nПрогорев от очага любви\n\nРазожжем пламя заново знамя\n\nЧто горит ярче всех тех звёзд\n\nЧто считал я ночами тщетно\n\nРади всех тех пролитых слёз\n\nЧто со временем стали пеплом\n\nДопишем историю кровью\n\nПройдем всё заново, снова\n\nЦена велика, но ведь болью\n\nИ ставятся точки от слова\n\nМаля, причалимся, не маячь\n\nСкоро мы станем пеплом\n\nЭхом вещей раздаётся тот плачь\n\nЧто по ночам терпеть нам\n\nПламя души, славься, гори\n\nВсе рвёт и пинается пекло\n\nНе потушить, как ни крути\n\nПепел развеет с ветром\n\nМаля, причалимся, не маячь\n\nСкоро мы станем пеплом\n\nЭхом вещей раздаётся тот плачь\n\nЧто по ночам терпеть нам\n\nПламя души, славься, гори\n\nВсе рвёт и пинается пекло\n\nНе потушить, как ни крути\n\nПепел развеет с ветром",
    imgSrc: "/releases/spi.jpg",
  },
  {
    id: 5,
    title: "ППМЛ",
    link: "https://music.yandex.ru/iframe/track/91287938/18152254",
    trackId: "91287938",
    albumId: "18152254",
    description: "2021, Produced by PARANOID Production/Mixing",
    text: "От твоего холода как-то теплее\n\nВажно ли тебе все это?\n\nМне так легко было сказать, что я скучал этим летом\n\nНо я\n\nБольше не вижу тебя\n\nБольше не знаю тебя\n\nЯ\n\nБольше не плавятся моря\n\nТы подожгла их и горят\n\nНо я\n\nПеребираю, во чтобы снова влюбилась ты\n\nКак у ветра, мне тебе удержать не хватило сил\n\nГде ты, я\n\nСияй, красивая, гаснут моря\n\nОкеан\n\nБоле мы с тобою не встретимся\n\nТак что прощай, прости\n\nТам, куда я ухожу\n\nТам, куда я ухожу — весна\n\nОтныне не сможешь ты больше меня найти\n\nВедь там, куда я ухожу\n\nТам, куда я ухожу",
    imgSrc: "/releases/pplm.jpg",
  },
  {
    id: 6,
    title: "Гори",
    link: "https://music.yandex.ru/iframe/track/105338328/22794385",
    trackId: "105338328",
    albumId: "22794385",
    description: "2022, mix/master DAN PARANOID",
    text: "Гори-гори, горе, не погасни\n\nГоре, гори, ясней свети, счастье\n\nГори-гори, пой, полыхай ярче\n\nГоре, гори, горе, гори\n\nГори-гори горе, не погасни\n\nГоре, гори, ясней свети, счастье\n\nГори-гори, пой, полыхай ярче\n\nГоре гори, горе гори\n\nГори-гори горе, не погасни\n\nГоре, гори, ясней свети, счастье\n\nГори-гори, пой, полыхай ярче\n\nГоре гори, горе гори\n\nПока пульс тает в часах\n\nПройдет и дрожь по краю света, я устану писать\n\nБросать и комкать письма ветру\n\nГоре гори, у меня нет слов\n\nВ городах летает и тает этот ловец снов\n\nНо я все пытаюсь, пытаюсь покорить вновь\n\nТвоё сердце будто бы лава, метеорит, но\n\nЗабери горе, ты забери на берега\n\nГде-то в море ты затони каменем и на века\n\nУлетай с ветром по миру, коли впредь мои глаза\n\nНе мозолило горе, прошу тебя, молю пока\n\nЗабери горе, ты забери на берега\n\nГде-то в море ты затони каменем и на века\n\nУлетай с ветром по миру, коли впредь мои глаза\n\nНе мозолило горе, прошу тебя, молю пока",
    imgSrc: "/releases/gori.jpg",
  },
  {
    id: 7,
    title: "Петля",
    link: "https://music.yandex.ru/iframe/track/82025578/15265836",
    trackId: "82025578",
    albumId: "15265836",
    description: "2021",
    text: "Моря горят на моей душе\n\nДемоны сверху ночью не спят\n\nВзгляд твой — петля, а ты — удушье\n\nВремя нам шепчет: «молчанье ягнят»\n\nЗаметался пожар голубой\n\nПозабылись родимые дали\n\nПод луной тёмной, дальней тропой\n\nПобредем мы по этой спирали\n\nРодная метелица и где вьюга моя\n\nВ душе моей поселится\n\nИ нету ни края\n\nБела дорога стелется\n\nЯ песню запоя, и–а\n\nРодная метелица и где вьюга моя\n\nВ душе моей поселится\n\nИ нету ни края\n\nБела дорога стелется\n\nЯ песню запоя, и–а",
    imgSrc: "/releases/petlya.jpg",
  },
  {
    id: 8,
    title: "Ты",
    link: "https://music.yandex.ru/iframe/track/96690544/19833774",
    trackId: "96690544",
    albumId: "19833774",
    description: "2021",
    text: "И гром и гроза\n\nТонут в слезах\n\nТучи все плачут\n\nИ топят планету\n\nЯ им рассказал\n\nНа всех языках\n\n«Меня разрывает, тебя рядом нету»\n\nТы теплый лучик, моя маля\n\nТемные тучи таят, а я\n\nТвой ищу ключик края, рая\n\nТы — моя тишина, ты — моя муза\n\nМы не одни\n\nТы чувствуешь что-то внутри тебя будит?\n\nЭти огни\n\nОни твои проводники в этой буре\n\nМы не одни\n\nВсегда будет тот, кто в итоге рассудит\n\nБоже, очнись\n\nЯ верю, что слышат нас ангелы судеб",
    imgSrc: "/releases/ti.jpg",
  },
  {
    id: 9,
    title: "Где я",
    link: "https://music.yandex.ru/iframe/track/80646747/14796932",
    trackId: "80646747",
    albumId: "14796932",
    description: "2021",
    text: "Как тот ветер сводил штиль с ума\n\nДразня–а–а\n\nНе спеша, еле–еле дышал\n\nЗвеня–а–а\n\nМоре воды скроет ярость грозы\n\nПлавится небо\n\nПолчаса топчется, но через сны\n\nПодарит за час до рассвета\n\nГде я\n\nГде я\n\nГде я\n\nГде я\n\nИстратятся слова\n\nТеряются люди\n\nСолнце упряталось в небесах\n\nЗа сутками года, так не всегда будет\n\nЗа громом блудит белая полоса\n\nИстратятся слова\n\nТеряются люди\n\nСолнце упряталось в небесах\n\nЗа сутками года, так не всегда будет\n\nЗа громом блудит белая",
    imgSrc: "/releases/gdeya.jpg",
  },
  {
    id: 10,
    title: "321",
    link: "https://music.yandex.ru/iframe/track/69421187/11611707",
    trackId: "69421187",
    albumId: "11611707",
    description: "2020",
    text: "Звёзды стоят на пути млечном\n\nТы не моя, но нам так легче\n\nТая, года ждут нашей встречи\n\nИ таем, летая-летая-летая\n\nЛетает звезда на пути млечном\n\nМая себя, но ведь так легче\n\nТая, года боль и слёзы не лечат\n\nИ тает, летая-летая-летая, тает дым\n\nМеняли раны, палитры, года, города на молитвы\n\nПеретеряли стороны Ра, нарочито ведь слёзы забыты\n\nПеруном плавили, праведным пламенем\n\nПой, вспоминай меня, задыхаясь, горя\n\nГласа, не угаснут глаза\n\nБоле ни шагу назад\n\nСветит звезда на полюса\n\nВремя ставит места\n\nГласа, не угаснут глаза\n\nБоле ни шагу назад\n\nСветит звезда на полюса",
    imgSrc: "/releases/321.jpg",
  },
  {
    id: 11,
    title: "Полная луна",
    link: "https://music.yandex.ru/iframe/track/88303263/17165349",
    trackId: "88303263",
    albumId: "17165349",
    description: "2021",
    text: "Полная луна маня меня воспламеняя\n\nДень ото дня дразня, смеясь, облик меняя\n\nЭто весна, все так же шаги выверяя\n\nГасну без сна, пока ищу, все потеряю\n\nПолная луна маня меня воспламеняя\n\nДень ото дня дразня, смеясь, облик меняя\n\nЭто весна, все так же шаги выверяя\n\nГасну без сна, пока ищу, все потеряю\n\nКак мог берег твои огни\n\nА ты мое пламя\n\nПленники моей любви\n\nНо мы так ярко сверкали\n\nДаже в сумраке тени\n\nЧуть еле вздыхая\n\nЛилии при нас цвели\n\nМетели взвывали\n\nПой, моя милая, пой\n\nИ пусть услышат твою песнь планеты\n\nТы дай мне свою далонь\n\nЯ нам оставлю на руках рассветы\n\nПолная луна маня меня воспламеняя\n\nДень ото дня дразня, смеясь, облик меняя\n\nЭто весна, все так же шаги выверяя\n\nГасну без сна, пока ищу, все потеряю\n\nПолная луна маня меня воспламеняя\n\nДень ото дня дразня, смеясь, облик меняя\n\nЭто весна, все так же шаги выверяя\n\nГасну без сна, пока ищу, все потеряю",
    imgSrc: "/releases/polnayaluna.jpg",
  },
];
